Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder Constructor
 Creates an empty geometry builder. This builder contains no geometries
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder()
Public Sub New
See Also
Reference
PolycurveGeometryBuilder Class
PolycurveGeometryBuilder Overload
Tekla.Structures.Geometry3d Namespace